{
  "task": {
    "title": "Терминал",
    "number": "6",
    "score": "25",
    "testExamples": [
      {
        "input": "4\notLLLrRuEe256LLLN\nLRLUUDE\nitisatest\nabNcdLLLeUfNxNx",
        "output": "route\n256\n-\n\n-\nitisatest\n-\naf\nx\nxb\necd\n-"
      }
    ],
    "userStatus": {
      "key": "SOLVED",
      "label": "Решена"
    },
    "condition": "Реализуйте элемент функциональности простейшего терминала.\n\nИзначально терминал содержит одну пустую строку, в начале которой находится курсор.\n\nВаша программа должна уметь обрабатывать последовательность символов (строку ввода). Обработка символа зависит от его значения:\n\n$\\bullet$ Строчная буква латинского алфавита или цифра обозначает, что соответствующий символ вставляется в положение курсора. Курсор сдвигается на позицию после вставленного символа.\n\n$\\bullet$ Буквы $\\texttt{L}$ и $\\texttt{R}$ обозначают нажатия стрелок влево и вправо. Они перемещают курсор на одну позицию влево или вправо. Если в соответствующем направлении нет символа, то операция\n$\\texttt{игнорируется}$. Заметьте, что курсор в любом случае\n$\\bold{остаётся}$ в той же строке.\n\n$\\bullet$ Буквы $\\texttt{U}$ и $\\texttt{D}$ обозначают нажатия стрелок вверх и вниз. Они перемещают курсор на одну позицию вверх или вниз. Если в соответствующем направлении нет строки, то операция $\\bold{игнорируется}$. Если строка есть, но в ней нужная позиция не существует, то курсор встаёт в $\\bold{конец}$ строки.\n\n$\\bullet$ Буквы $\\texttt{B}$ и $\\texttt{E}$ обозначают нажатия клавиш $\\texttt{Home}$ и $\\texttt{End}$. Они перемещают курсор в начало или в конец текущей строки.\n\n$\\bullet$ Буква $\\texttt{N}$ обозначает нажатие клавиши $\\texttt{Enter}$ — происходит вставка новой строки. Если курсор находился не в конце текущей строки, то она разрывается, и часть после курсора переносится в новую строку. Курсор после этой операции стоит в начале новой строки.\n\nВы можете представлять себе, что эмулируете последовательность нажатий в простейшем текстовом редакторе, в котором курсор занимает позицию между двумя символами строки (или находится в начале или конце строки).\n\nНапример, если строка ввода имеет вид $\\texttt{otLLLrRuEe256LLLN}$, то в результате получится две строки:\n\n$\\bullet$ $\\texttt{route}$\n$\\bullet$ $\\texttt{256}$\n\nПромоделируйте последовательность действий и выведите результат.",
    "inputFormat": "stdin",
    "outputFormat": "stdout",
    "inputFormatDescription": "В первой строке входных данных записано целое число $t$ ($1 \\le t \\le 100$) — количество наборов входных данных.\n\nНаборы входных данных в тесте независимы. Друг на друга они никак не влияют.\n\nКаждый набор входных данных состоит из одной непустой строки —последовательности символов для обработки. Гарантируется, что длина этой строки не превосходит 50. Допустимые символы в строке — строчные буквы латинского алфавита, цифры и буквы $\\texttt{L}$, $\\texttt{R}$, $\\texttt{U}$, $\\texttt{D}$, $\\texttt{B}$, $\\texttt{E}$, $\\texttt{N}$.",
    "outputFormatDescription": "Для каждого набора входных данных выведите итоговую последовательность строк. Выводите все строки, включая пустые. После каждого набора выходных данных выведите дополнительную строку с единственным символом - (минус).",
    "languages": ["GO"],
    "timeLimit": 2000,
    "memoryLimit": 512,
    "testArchiveUrl": "test-examples-taskbook-api/7.zip",
    "countOfSuccessSolvers": "91"
  }
}
