{
  "task": {
    "title": "Автомобильные номера",
    "number": "3",
    "score": "15",
    "testExamples": [
      {
        "input": "6\nR48FAO00OOO0OOA99OKA99OK\nR48FAO00OOO0OOA99OKA99O\nA9PQ\nA9PQA\nA99AAA99AAA99AAA99AA\nAP9QA",
        "output": "R48FA O00OO O0OO A99OK A99OK\n-\nA9PQ\n-\nA99AA A99AA A99AA A99AA\n-"
      }
    ],
    "userStatus": {
      "key": "SOLVED",
      "label": "Решена"
    },
    "condition": "В Берляндии автомобильные номера состоят из цифр и прописных букв латинского алфавита. Они бывают двух видов:\n\n· либо автомобильный номер имеет вид $\\it{буква-цифра-цифра-буква-буква}$ (примеры корректных номеров первого вида: $\\texttt{R48FA}$, $\\texttt{O00OO}$, $\\texttt{A99OK}$);\n· либо автомобильный номер имеет вид $\\it{буква-цифра-буква-буква}$ (примеры корректных номеров второго вида: $\\texttt{T7RR}$, $\\texttt{A9PQ}$, $\\texttt{O0OO}$).\n\nТаким образом, каждый автомобильный номер является строкой либо первого, либо второго вида.\n\nВам задана строка из цифр и прописных букв латинского алфавита. Можно ли разделить её пробелами на последовательность корректных автомобильных номеров? Иными словами, проверьте, что заданная строка может быть образована как последовательность корректных автомобильных номеров, которые записаны подряд без пробелов. В случае положительного ответа выведите любое такое разбиение.\n",
    "inputFormat": "stdin",
    "outputFormat": "stdout",
    "inputFormatDescription": "В первой строке записано целое число $t$ ($1 \\le t \\le 1000$) — количество наборов входных данных в тесте.\n\nНаборы входных данных в тесте независимы. Друг на друга они никак не влияют.\n\nКаждый набор входных данных — непустая строка $s$, которая состоит из цифр и прописных букв латинского алфавита. Длина строки — от 1 до 50 символов.\n",
    "outputFormatDescription": "Выведите $n$ строк: очередная строка должна содержать ответ для соответствующего набора входных данных.\n\nЕсли ответ отрицательный — то есть заданную строку $s$ невозможно представить как последовательность номеров автомобилей — строка в выводе должна содержать единственный символ ''-'' (минус, ASCII-код 45).\n\nВ случае положительного ответа выведите любое разбиение заданной строки $s$ на последовательность корректных номеров. Каждый номер должен соответствовать одному из двух видов (см. условие). Номера разделяйте пробелами. Вы можете выводить произвольное количество пробелов и даже лишние пробелы после последнего номера.\n",
    "languages": ["GO"],
    "timeLimit": 2000,
    "memoryLimit": 512,
    "testArchiveUrl": "test-examples-taskbook-api/4.zip",
    "countOfSuccessSolvers": "235"
  }
}
